Model: "2d_convolution_autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 128, 314, 8)]     0         
_________________________________________________________________
enc_conv2d_elu_1 (Conv2D)    (None, 128, 314, 128)     9344      
_________________________________________________________________
enc_batchnorm_1 (BatchNormal (None, 128, 314, 128)     512       
_________________________________________________________________
enc_maxpool2d_1 (MaxPooling2 (None, 64, 157, 128)      0         
_________________________________________________________________
enc_conv2d_elu_2 (Conv2D)    (None, 64, 157, 64)       73792     
_________________________________________________________________
enc_batchnorm_2 (BatchNormal (None, 64, 157, 64)       256       
_________________________________________________________________
enc_maxpool2d_2 (MaxPooling2 (None, 32, 79, 64)        0         
_________________________________________________________________
enc_conv2d_elu_3 (Conv2D)    (None, 32, 79, 32)        18464     
_________________________________________________________________
enc_batchnorm_3 (BatchNormal (None, 32, 79, 32)        128       
_________________________________________________________________
enc_maxpool2d_3 (MaxPooling2 (None, 16, 40, 32)        0         
_________________________________________________________________
enc_conv2d_elu_4 (Conv2D)    (None, 16, 40, 16)        4624      
_________________________________________________________________
enc_batchnorm_4 (BatchNormal (None, 16, 40, 16)        64        
_________________________________________________________________
enc_maxpool2d_4 (MaxPooling2 (None, 8, 20, 16)         0         
_________________________________________________________________
enc_conv2d_elu_5 (Conv2D)    (None, 8, 20, 8)          1160      
_________________________________________________________________
enc_batchnorm_5 (BatchNormal (None, 8, 20, 8)          32        
_________________________________________________________________
enc_maxpool2d_5 (MaxPooling2 (None, 4, 10, 8)          0         
_________________________________________________________________
enc_flatten_1 (Flatten)      (None, 320)               0         
_________________________________________________________________
enc_dense_1 (Dense)          (None, 1)                 321       
_________________________________________________________________
enc_dropout_1 (Dropout)      (None, 1)                 0         
_________________________________________________________________
dec_dense_1 (Dense)          (None, 320)               640       
_________________________________________________________________
dec_dropout_1 (Dropout)      (None, 320)               0         
_________________________________________________________________
tf_op_layer_dec_reshape_1 (T [(None, 4, 10, 8)]        0         
_________________________________________________________________
dec_conv2d_elu_1 (Conv2D)    (None, 4, 10, 8)          584       
_________________________________________________________________
dec_batchnorm_1 (BatchNormal (None, 4, 10, 8)          32        
_________________________________________________________________
dec_upsampling2d_1 (UpSampli (None, 8, 20, 8)          0         
_________________________________________________________________
dec_conv2d_elu_2 (Conv2D)    (None, 8, 20, 16)         1168      
_________________________________________________________________
dec_batchnorm_2 (BatchNormal (None, 8, 20, 16)         64        
_________________________________________________________________
dec_upsampling2d_2 (UpSampli (None, 16, 40, 16)        0         
_________________________________________________________________
dec_conv2d_elu_3 (Conv2D)    (None, 16, 40, 32)        4640      
_________________________________________________________________
dec_batchnorm_3 (BatchNormal (None, 16, 40, 32)        128       
_________________________________________________________________
dec_upsampling2d_3 (UpSampli (None, 32, 80, 32)        0         
_________________________________________________________________
dec_conv2d_elu_4 (Conv2D)    (None, 32, 80, 64)        18496     
_________________________________________________________________
dec_batchnorm_4 (BatchNormal (None, 32, 80, 64)        256       
_________________________________________________________________
dec_upsampling2d_4 (UpSampli (None, 64, 160, 64)       0         
_________________________________________________________________
dec_conv2d_elu_5 (Conv2D)    (None, 64, 160, 128)      73856     
_________________________________________________________________
dec_conv2d_elu_6 (Conv2D)    (None, 64, 160, 8)        9224      
_________________________________________________________________
dec_batchnorm_5 (BatchNormal (None, 64, 160, 8)        32        
_________________________________________________________________
dec_upsampling2d_5 (UpSampli (None, 128, 320, 8)       0         
_________________________________________________________________
output (Cropping2D)          (None, 128, 314, 8)       0         
=================================================================
Total params: 217,817
Trainable params: 217,065
Non-trainable params: 752
_________________________________________________________________
