Model: "2d_convolution"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
stft_input (InputLayer)      [(None, 160000, 1)]       0         
_________________________________________________________________
stft (STFT)                  (None, 1000, 257, 1)      0         
_________________________________________________________________
magnitude (Magnitude)        (None, 1000, 257, 1)      0         
_________________________________________________________________
apply_filterbank (ApplyFilte (None, 1000, 128, 1)      0         
_________________________________________________________________
magnitude_to_decibel (Magnit (None, 1000, 128, 1)      0         
_________________________________________________________________
batch_norm (LayerNormalizati (None, 1000, 128, 1)      256       
_________________________________________________________________
conv2d_tanh (Conv2D)         (None, 1000, 128, 8)      400       
_________________________________________________________________
max_pool_2d_1 (MaxPooling2D) (None, 500, 64, 8)        0         
_________________________________________________________________
conv2d_relu_1 (Conv2D)       (None, 500, 64, 16)       3216      
_________________________________________________________________
max_pool_2d_2 (MaxPooling2D) (None, 250, 32, 16)       0         
_________________________________________________________________
conv2d_relu_2 (Conv2D)       (None, 250, 32, 16)       2320      
_________________________________________________________________
max_pool_2d_3 (MaxPooling2D) (None, 125, 16, 16)       0         
_________________________________________________________________
conv2d_relu_3 (Conv2D)       (None, 125, 16, 32)       4640      
_________________________________________________________________
max_pool_2d_4 (MaxPooling2D) (None, 63, 8, 32)         0         
_________________________________________________________________
conv2d_relu_4 (Conv2D)       (None, 63, 8, 32)         9248      
_________________________________________________________________
conv2d_relu_5 (Conv2D)       (None, 63, 8, 64)         18496     
_________________________________________________________________
max_pool_2d_5 (MaxPooling2D) (None, 32, 4, 64)         0         
_________________________________________________________________
conv2d_relu_6 (Conv2D)       (None, 32, 4, 64)         36928     
_________________________________________________________________
flatten (Flatten)            (None, 8192)              0         
_________________________________________________________________
dropout (Dropout)            (None, 8192)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                524352    
_________________________________________________________________
softmax (Dense)              (None, 4)                 260       
=================================================================
Total params: 600,116
Trainable params: 600,116
Non-trainable params: 0
_________________________________________________________________
