Model: "2d_convolution_autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 128, 314, 8)]     0         
_________________________________________________________________
conv2d_tanh_1 (Conv2D)       (None, 128, 314, 8)       3144      
_________________________________________________________________
batch_norm_1 (BatchNormaliza (None, 128, 314, 8)       32        
_________________________________________________________________
max_pool_2d_1 (MaxPooling2D) (None, 64, 157, 8)        0         
_________________________________________________________________
conv2d_relu_1 (Conv2D)       (None, 64, 157, 16)       3216      
_________________________________________________________________
batch_norm_2 (BatchNormaliza (None, 64, 157, 16)       64        
_________________________________________________________________
max_pool_2d_2 (MaxPooling2D) (None, 32, 79, 16)        0         
_________________________________________________________________
conv2d_relu_2 (Conv2D)       (None, 32, 79, 32)        4640      
_________________________________________________________________
batch_norm_3 (BatchNormaliza (None, 32, 79, 32)        128       
_________________________________________________________________
max_pool_2d_3 (MaxPooling2D) (None, 16, 40, 32)        0         
_________________________________________________________________
conv2d_relu_3 (Conv2D)       (None, 16, 40, 32)        9248      
_________________________________________________________________
batch_norm_4 (BatchNormaliza (None, 16, 40, 32)        128       
_________________________________________________________________
max_pool_2d_4 (MaxPooling2D) (None, 8, 20, 32)         0         
_________________________________________________________________
conv2d_relu_4 (Conv2D)       (None, 8, 20, 32)         9248      
_________________________________________________________________
batch_norm_5 (BatchNormaliza (None, 8, 20, 32)         128       
_________________________________________________________________
max_pool_2d_5 (MaxPooling2D) (None, 4, 10, 32)         0         
_________________________________________________________________
conv2d_relu_5 (Conv2D)       (None, 4, 10, 32)         9248      
_________________________________________________________________
batch_norm_6 (BatchNormaliza (None, 4, 10, 32)         128       
_________________________________________________________________
up_2d_1 (UpSampling2D)       (None, 8, 20, 32)         0         
_________________________________________________________________
conv2d_relu_6 (Conv2D)       (None, 8, 20, 16)         12816     
_________________________________________________________________
batch_norm_7 (BatchNormaliza (None, 8, 20, 16)         64        
_________________________________________________________________
up_2d_2 (UpSampling2D)       (None, 16, 40, 16)        0         
_________________________________________________________________
conv2d_relu_7 (Conv2D)       (None, 16, 40, 16)        6416      
_________________________________________________________________
batch_norm_8 (BatchNormaliza (None, 16, 40, 16)        64        
_________________________________________________________________
up_2d_3 (UpSampling2D)       (None, 32, 80, 16)        0         
_________________________________________________________________
conv2d_relu_8 (Conv2D)       (None, 32, 80, 16)        6416      
_________________________________________________________________
batch_norm_9 (BatchNormaliza (None, 32, 80, 16)        64        
_________________________________________________________________
up_2d_4 (UpSampling2D)       (None, 64, 160, 16)       0         
_________________________________________________________________
conv2d_tanh_2 (Conv2D)       (None, 64, 160, 8)        6280      
_________________________________________________________________
batch_norm_10 (BatchNormaliz (None, 64, 160, 8)        32        
_________________________________________________________________
up_2d_5 (UpSampling2D)       (None, 128, 320, 8)       0         
_________________________________________________________________
cropping2d (Cropping2D)      (None, 128, 314, 8)       0         
=================================================================
Total params: 71,504
Trainable params: 71,088
Non-trainable params: 416
_________________________________________________________________
