Model: "2d_convolution_autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
stft_1_input (InputLayer)    [(None, 160000, 8)]       0         
_________________________________________________________________
stft_1 (STFT)                (None, 1000, 257, 8)      0         
_________________________________________________________________
magnitude_1 (Magnitude)      (None, 1000, 257, 8)      0         
_________________________________________________________________
apply_filterbank_1 (ApplyFil (None, 1000, 128, 8)      0         
_________________________________________________________________
magnitude_to_decibel_1 (Magn (None, 1000, 128, 8)      0         
_________________________________________________________________
batch_norm (LayerNormalizati (None, 1000, 128, 8)      256       
_________________________________________________________________
conv2d_tanh_1 (Conv2D)       (None, 1000, 128, 8)      3144      
_________________________________________________________________
max_pool_2d_1 (MaxPooling2D) (None, 500, 64, 8)        0         
_________________________________________________________________
conv2d_relu_1 (Conv2D)       (None, 500, 64, 16)       3216      
_________________________________________________________________
max_pool_2d_3 (MaxPooling2D) (None, 250, 32, 16)       0         
_________________________________________________________________
conv2d_relu_3 (Conv2D)       (None, 250, 32, 32)       4640      
_________________________________________________________________
max_pool_2d_5 (MaxPooling2D) (None, 125, 16, 32)       0         
_________________________________________________________________
conv2d_relu_7 (Conv2D)       (None, 125, 16, 32)       9248      
_________________________________________________________________
up_2d_1 (UpSampling2D)       (None, 250, 32, 32)       0         
_________________________________________________________________
conv2d_relu_9 (Conv2D)       (None, 250, 32, 16)       12816     
_________________________________________________________________
up_2d_2 (UpSampling2D)       (None, 500, 64, 16)       0         
_________________________________________________________________
conv2d_tanh_2 (Conv2D)       (None, 500, 64, 8)        6280      
_________________________________________________________________
up_2d_0 (UpSampling2D)       (None, 1000, 128, 8)      0         
=================================================================
Total params: 39,600
Trainable params: 39,600
Non-trainable params: 0
_________________________________________________________________
